Сверт2.ОценкаСостоянияПредприятия/src/DataProcessors/ИнтеграцияБизнесАналитик/ИнтеграцияБизнесАналитик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтеграцияБизнесАналитик</name>
</mdclass:DataProcessor>

Сверт2.ОценкаСостоянияПредприятия/src/InformationRegisters/ПоказателиДляОтчета/ПоказателиДляОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиДляОтчета</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ОценкиБА</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Сверт2.ОценкаСостоянияПредприятия/src/DataProcessors/ИнтеграцияБизнесАналитик/Forms/ФормаСправка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	HTML = ПолучитьHTML();
	
	
КонецПроцедуры
&НаСервере
Функция ПолучитьHTML()
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("справка_ОценкаСостоянияПредприятия");
	Возврат Макет.ПолучитьТекст();
КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Ждём, пока HTML загрузится
    ПодключитьОбработчикОжидания("ЗагрузитьДанныеВHTML", 1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеВHTML()  
	Если Элементы.HTML.Документ = Неопределено Тогда
		// Документ ещё не сформирован — повторим попытку через секунду
		ПодключитьОбработчикОжидания("ЗагрузитьДанныеВHTML", 1, Истина);
		
	КонецЕсли;
	// Собираем данные на сервере
	JSONДанные = ПолучитьПоказателиJSON();
     КодJS = "загрузитьДанные(" + JSONДанные + ")";
    // Получаем окно браузера из поля HTML
	//Документ = Элементы.HTML.Документ;    
	 // Прямой вызов eval через defaultView — без промежуточной переменной
    Попытка
        Элементы.HTML.Документ.defaultView.eval(КодJS);
    Исключение
        Сообщить("Ошибка eval: " + ОписаниеОшибки());
    КонецПопытки;
	//Окно = Документ.parentWindow;
	//
	//Если Окно = Неопределено Тогда
	//    // Для Chromium-движка (8.3.22+)
	//    Окно = Документ.defaultView;
	//КонецЕсли;
	//
	//// Передаём данные через eval
	//Окно.eval("загрузитьДанные(" + JSONДанные + ")");
КонецПроцедуры

&НаСервере
Функция ПолучитьПоказателиJSON()
    // Здесь — реальный расчёт из ваших регистров
    // Для примера задаём вручную  
	
	
    ДанныеПоРегистру = ПолучитьДанныеПоОтчету();
    Данные = Новый Структура;
    Данные.Вставить("org", "Курорт УТЕС");
    Данные.Вставить("period", "1 кв. 2026 г.");
    
    // Ликвидность
    Данные.Вставить("current_ratio", ДанныеПоРегистру.Получить("59"));
    Данные.Вставить("quick_ratio", ДанныеПоРегистру.Получить("62"));
    Данные.Вставить("absolute_ratio", ДанныеПоРегистру.Получить("67"));
    
    // Рентабельность (в процентах)
    Данные.Вставить("operating", ДанныеПоРегистру.Получить("173"));
    Данные.Вставить("ros", ДанныеПоРегистру.Получить("176"));
    Данные.Вставить("roe", ДанныеПоРегистру.Получить("179"));
    Данные.Вставить("roa", ДанныеПоРегистру.Получить("182"));
    Данные.Вставить("rca", ДанныеПоРегистру.Получить("185"));
    Данные.Вставить("rnca", ДанныеПоРегистру.Получить("188"));
    Данные.Вставить("fixed_assets", ДанныеПоРегистру.Получить("191"));
    
    // Гостиничные (если применимо — можно не передавать)
    Данные.Вставить("occupancy", ДанныеПоРегистру.Получить("195"));
    Данные.Вставить("alos", ДанныеПоРегистру.Получить("196"));
    Данные.Вставить("revpag", ДанныеПоРегистру.Получить("197"));
    Данные.Вставить("adr", ДанныеПоРегистру.Получить("198"));
    
    // Сериализуем в JSON
    Запись = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "", Истина);
    Запись.УстановитьСтроку(ПараметрыЗаписиJSON);
    ЗаписатьJSON(Запись, Данные);
    
    Возврат Запись.Закрыть();
КонецФункции

Функция ПолучитьДанныеПоОтчету()
	
	ПоказателиРасчетов = Новый Соответствие();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиДляОтчетаСрезПоследних.Оценка КАК Оценка,
		|	ПоказателиДляОтчетаСрезПоследних.Показатель КАК Показатель,
		|	ПоказателиДляОтчетаСрезПоследних.Показатель.Код КАК ПоказательКод
		|ИЗ
		|	РегистрСведений.ПоказателиДляОтчета.СрезПоследних(, ) КАК ПоказателиДляОтчетаСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоказателиРасчетов.Вставить(Выборка.ПоказательКод,Выборка.Оценка);
	КонецЦикла;
	
   Возврат ПоказателиРасчетов;
КонецФункции


&НаКлиенте
Процедура ОбновитьПоказатели(Команда)
    // Команда из командной панели формы — для ручного обновления
    ЗагрузитьДанныеВHTML();
КонецПроцедуры
